#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiap/gh-actions/runs/run-tyE8egBt5tXTVReT

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=definite-earwig]
aws_iam_user_policy_attachment.new_user_policy_attachment: Refreshing state... [id=example_user-20240621004105897100000001]
aws_iam_access_key.new_user_access_key: Refreshing state... [id=AKIAX4X7DKAX6DEW2DKE]
aws_iam_user.new_user: Refreshing state... [id=example_user]
aws_security_group.web-sg: Refreshing state... [id=sg-0129cc03e7fa2952f]
data.aws_ami.ubuntu: Refreshing...
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-0ba8562d785e35387]
aws_instance.web: Refreshing state... [id=i-06213dce13eda4c19]
aws_instance.web: Drift detected (delete)
aws_security_group.web-sg: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.web has been deleted
  - resource "aws_instance" "web" {
        id                                   = "i-06213dce13eda4c19"
      - public_dns                           = "ec2-54-162-215-100.compute-1.amazonaws.com" -> null
        # (37 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_access_key.new_user_access_key will be destroyed
  - resource "aws_iam_access_key" "new_user_access_key" {
      - create_date          = "2024-06-21T00:41:05Z" -> null
      - id                   = "AKIAX4X7DKAX6DEW2DKE" -> null
      - secret               = (sensitive value) -> null
      - ses_smtp_password_v4 = (sensitive value) -> null
      - status               = "Active" -> null
      - user                 = "example_user" -> null
    }

  # aws_iam_user.new_user will be destroyed
  - resource "aws_iam_user" "new_user" {
      - arn           = "arn:aws:iam::542774612015:user/example_user" -> null
      - force_destroy = false -> null
      - id            = "example_user" -> null
      - name          = "example_user" -> null
      - path          = "/" -> null
      - tags          = {
          - "Name" = "User Impacta"
        } -> null
      - tags_all      = {
          - "Name" = "User Impacta"
        } -> null
      - unique_id     = "AIDAX4X7DKAX2SYYQOUV7" -> null
    }

  # aws_iam_user_policy_attachment.new_user_policy_attachment will be destroyed
  - resource "aws_iam_user_policy_attachment" "new_user_policy_attachment" {
      - id         = "example_user-20240621004105897100000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess" -> null
      - user       = "example_user" -> null
    }

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-0ba8562d785e35387"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "d5457b66f3845c2eb700f564cfb8145290bd3dba"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0129cc03e7fa2952f",
        ]

      + capacity_reservation_specification (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

Plan: 1 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-54-162-215-100.compute-1.amazonaws.com:8080" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @FabianoCarneiro, Action: `pull_request`*